In [29]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('titanic.csv')

In [14]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
Survived                   887 non-null int64
Pclass                     887 non-null int64
Name                       887 non-null object
Sex                        887 non-null object
Age                        887 non-null float64
Siblings/Spouses Aboard    887 non-null int64
Parents/Children Aboard    887 non-null int64
Fare                       887 non-null float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.5+ KB

In [6]:
list(df)

['Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'Siblings/Spouses Aboard',
 'Parents/Children Aboard',
 'Fare']

In [8]:
df.shape

(887, 8)

In [33]:
dfSex = pd.pivot_table(df, index = ["Sex","Age","Pclass"], aggfunc=np.sum)
dfSex.head()

                        Fare  Parents/Children Aboard  \
Sex    Age  Pclass
female 0.75 3        38.5166                        2
       1.00 3        26.8750                        3
       2.00 1       151.5500                        2
            2        26.0000                        1
            3       104.2833                        7

                    Siblings/Spouses Aboard  Survived
Sex    Age  Pclass
female 0.75 3                             4         2
       1.00 3                             1         2
       2.00 1                             1         0
            2                             1         1
            3                             8         2

In [19]:
dfAdult = df[df['Age'] > 18].groupby('Sex')['Siblings/Spouses Aboard','Parents/Children Aboard'].count()
dfAdult

        Siblings/Spouses Aboard  Parents/Children Aboard
Sex
female                      234                      234
male                        487                      487

In [20]:
dfChild= df[df['Age'] < 18].groupby('Sex')['Siblings/Spouses Aboard','Parents/Children Aboard'].count()
dfChild

        Siblings/Spouses Aboard  Parents/Children Aboard
Sex
female                       63                       63
male                         67                       67

In [27]:
result = pd.cut(df['Age'], [0, 15, 25, 45, 65])
result

0      (15, 25]
1      (25, 45]
2      (25, 45]
3      (25, 45]
4      (25, 45]
5      (25, 45]
6      (45, 65]
7       (0, 15]
8      (25, 45]
9       (0, 15]
10      (0, 15]
11     (45, 65]
12     (15, 25]
13     (25, 45]
14      (0, 15]
15     (45, 65]
16      (0, 15]
17     (15, 25]
18     (25, 45]
19     (15, 25]
20     (25, 45]
21     (25, 45]
22      (0, 15]
23     (25, 45]
24      (0, 15]
25     (25, 45]
26     (25, 45]
27     (15, 25]
28     (15, 25]
29     (15, 25]
         ...
857    (15, 25]
858    (45, 65]
859     (0, 15]
860    (15, 25]
861    (25, 45]
862    (25, 45]
863    (25, 45]
864    (15, 25]
865     (0, 15]
866    (25, 45]
867    (45, 65]
868    (25, 45]
869    (45, 65]
870    (25, 45]
871     (0, 15]
872    (15, 25]
873    (15, 25]
874    (15, 25]
875    (45, 65]
876    (15, 25]
877    (25, 45]
878    (15, 25]
879    (25, 45]
880    (15, 25]
881    (25, 45]
882    (25, 45]
883    (15, 25]
884     (0, 15]
885    (25, 45]
886    (25, 45]
Name: Age, Length: 887, dtype: category
Categories (4, interval[int64]): [(0, 15] < (15, 25] < (25, 45] < (45, 65]]